Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 26, 26, 64)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 13, 13, 64)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 11, 11, 32)        18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 800)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 10)                8010      
=================================================================
Total params: 27,114
Trainable params: 27,114
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 24, 24, 64)        1664      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 10)                5130      
=================================================================
Total params: 58,026
Trainable params: 58,026
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 22, 22, 64)        3200      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 5, 5, 32)          100384    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                1290      
=================================================================
Total params: 104,874
Trainable params: 104,874
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 26, 26, 64)        640       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 13, 13, 64)        0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 11, 11, 32)        18464     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 10)                8010      
=================================================================
Total params: 27,114
Trainable params: 27,114
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_26 (Conv2D)           (None, 24, 24, 64)        1664      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 10)                5130      
=================================================================
Total params: 58,026
Trainable params: 58,026
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 22, 22, 64)        3200      
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 5, 5, 32)          100384    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 10)                1290      
=================================================================
Total params: 104,874
Trainable params: 104,874
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 26, 26, 64)        640       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 13, 13, 64)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 11, 11, 32)        18464     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 10)                8010      
=================================================================
Total params: 27,114
Trainable params: 27,114
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_32 (Conv2D)           (None, 24, 24, 64)        1664      
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 10)                5130      
=================================================================
Total params: 58,026
Trainable params: 58,026
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_34 (Conv2D)           (None, 22, 22, 64)        3200      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 5, 5, 32)          100384    
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 10)                1290      
=================================================================
Total params: 104,874
Trainable params: 104,874
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


