Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 26, 26, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 32)        18464     
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                184330    
=================================================================
Total params: 203,434
Trainable params: 203,434
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 24, 24, 64)        1664      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 20, 20, 32)        51232     
_________________________________________________________________
flatten_1 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                128010    
=================================================================
Total params: 180,906
Trainable params: 180,906
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 22, 22, 64)        3200      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 32)        100384    
_________________________________________________________________
flatten_2 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                81930     
=================================================================
Total params: 185,514
Trainable params: 185,514
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 26, 26, 64)        640       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 24, 24, 32)        18464     
_________________________________________________________________
flatten_3 (Flatten)          (None, 18432)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                184330    
=================================================================
Total params: 203,434
Trainable params: 203,434
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 24, 24, 64)        1664      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 20, 32)        51232     
_________________________________________________________________
flatten_4 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 10)                128010    
=================================================================
Total params: 180,906
Trainable params: 180,906
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 22, 22, 64)        3200      
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 32)        100384    
_________________________________________________________________
flatten_5 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 10)                81930     
=================================================================
Total params: 185,514
Trainable params: 185,514
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 26, 26, 64)        640       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 24, 24, 32)        18464     
_________________________________________________________________
flatten_6 (Flatten)          (None, 18432)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                184330    
=================================================================
Total params: 203,434
Trainable params: 203,434
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 24, 24, 64)        1664      
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 20, 20, 32)        51232     
_________________________________________________________________
flatten_7 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 10)                128010    
=================================================================
Total params: 180,906
Trainable params: 180,906
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 22, 22, 64)        3200      
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 16, 16, 32)        100384    
_________________________________________________________________
flatten_8 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 10)                81930     
=================================================================
Total params: 185,514
Trainable params: 185,514
Non-trainable params: 0
_________________________________________________________________
l: o
a: c
v: a
v: a


